{
  "enabled": true,
  "initialPosition": {"mapName": "world1", "x": 168, "y": 65},
  "distanceLimit": 3,
  "visibleName": " ",
    "display": [
    {
      "zIndex": 11,
      "layerName": "npcImage",
      "renderFunction": "_drawOneCharacterImage",
      "renderArgs": null,
      "character": "npc_Male 18-1"
    }
  ],
  "FSM": {
    "initialState": "s1",
    "states": {
      "s1": {
        "func": "showDialog",
        "kwargs": {
          "dialogs": "<b>協會成立宗旨與簡介</b><br>本會成立於1983年，為資訊、軟體和新興技術相關產業的專業團體，也是台灣最具歷史及規模的高科技協會之一，多次獲得台灣內政部評選為最優良人民團體獎。<br>結合資訊軟體同業，謀求共同利益，並爭取政府制定有利本業發展之產業政策。<br>協助推廣資訊軟體應用，促進產業升級，推動資訊化社會。<br>提供會員服務，參與並舉辦國際性活動，爭取商機。<br>1984年成為全亞洲資訊產業之「亞太資訊服務業組織(ASOCIO) 」之創始會員國代表；於1994年加入全球資訊業之「世界資訊科技暨服務業聯盟(WITSA)」擔任理事，中華軟協為國內資訊產業中最具規模與影響力的公協會之一。<br><br>現任理事長：沈柏延理事長<br>大同世界科技公司董事長兼策略長<br>大同股份有限公司執行副總經理<br>大世科技(上海)公司董事長<br>群輝商務科技董事長<br>台灣數位鑑識發展協會(ACFD) 理事<br>沈理事長以三大策略及六項重點工作，積極推動會務；三大策略為促進政府數位政策發展、提升產業數位轉型、擴大市場及會員服務；六項重點工作包括全力協助執行政府政策，提升國家資訊競爭力、推廣電腦軟體應用及人才培訓、促進工商產業升級、擴大資訊軟體應用市場、推動國際交流、促成同業合作，謀求共同利益。2021年因應當年疫情，由中華軟協主辦之「2021數位應用週」全面轉型為線上論壇與線上展示會，共計13場次主題論壇，邀請產、官、學、研領域專家進行專題演講，分享5G、國際行銷、智慧照護、智慧製造、智慧廣告、智慧零售、AIoT、Blockchain、資訊安全等產業趨勢及應用情境，藉此機會協助會原廠商拓產商機，一同窺探未來數位新商機。同時創新數位應用館同步展出「智慧應用」、「雲端服務」、「資訊安全」以及「新創創新」等四大處提管，提供多元解決方案及應用案例；全官網累積瀏覽超過15萬人，論壇亦近3萬人觀看。<br><br>更多中華軟協消息，請上官網瀏覽：<a href='https://www.cisanet.org.tw/' target='_blank'>https://www.cisanet.org.tw/</a>",
          "options": {
            "組織及會員概況": "s2",
            "近年重要活動": "s3",
            "積極參與政府政策": "s4"
          }
        }
      },
      "s2": {
        "func": "showDialog",
        "kwargs": {
          "dialogs": "<b>組織及會員概況</b><br>有團體會員超過600家，包括從事資訊軟體開發、系統整合、雲端服務、物聯網、資訊安全、顧問諮詢、教育訓練等之企業。<br>因應時代趨勢的潮流，內部除以各產業面向分工外，會員交流亦成立九個促進會（資安產業促進會、區塊鏈產業促進會、AI大數據智慧應用促進會、智慧製造促進會、5G暨物聯網智慧應用促進會、智慧零售物流供應鏈促進會、ESG數位促進會、智慧醫療與高齡照護促進會及智慧廣告與行銷促進會）、兩個任務組（政府產業政策與環境、會員服務）、一個聯盟（開放軟體產業生態系聯盟）以精準產業面向服務各類別會員。",
          "options": {
            "OK": "d"
          }
        }
      },
      "s3": {
        "func": "showDialog",
        "kwargs": {
          "dialogs": "<b>《全球數位轉型 臺灣智慧共行》論壇</b><br>中華軟協為協助台灣產業更加順利朝向數位轉型之路邁進，特於110年3月30日假台北喜來登飯店舉辦「全球數位轉型、台灣智慧共行」論壇，當日吸引近200位產、官、學、研菁英薈萃，齊心關注全球數位轉型朝流下，未來台灣將面臨的機會與挑戰。<br><b>ASOCIO多國線上論壇</b><br>參與亞太地區多國的線上論壇，交流分享台灣在後疫情時代的資通訊軟體應用經驗。<br>中華軟協集結多家台灣代表性廠商，提供科技防疫解決方案，包含「智慧醫療(Smart Medical)-工研院、磐儀科技、慧誠智醫；遠距辦公(Work From Home)-資策會、訊連科技、合勤科技；線上學習(Online Learning)-旭聯科技、巨匠電腦；雲⋯⋯端客服中心(Contact Center)-大同世界科技、程曦資訊」等。<br><b>AI解決方案與資安線上國際記者會</b><br>本會與外貿協會合作辦理AI解決方案與資安線上國際記者會。吸引美國、日本、馬來西亞、新加坡、孟加拉、緬甸、菲律賓、泰國、越南、歐洲、德國、義大利、巴西、印度、印尼、埃及等16個國家及逾160位買家與外媒線上報名，在線觀看人次逾200人。<b>本會沈理事長 當選WITSA新任理事</b><br>WITSA世界資訊科技與服務業聯盟18日改選2020-2022年度主席與理事會，會員國希臘信息技術與通信企業聯合會（SEPE）代表Yannis Sirros被推舉為新任主席，中華民國資訊軟體協會理事長沈柏延則高票當選WITSA新理事會成員。",
          "options": {
            "OK": "d"
          }
        }
      },
      "s4": {
        "func": "showDialog",
        "kwargs": {
          "dialogs": "<b>民間支持-加速政府落實成立「數位科技發展部會」</b><br>邀請行政院吳政忠政務委員、立法院范雲委員、蘇巧慧委員出席，針對政府即將成立「數位科技發展部會」之組織功能、法規、人力及資通訊環境等議題，提供產業觀察與政策落實建言。<br><b>政府採購法修法座談會</b><br>資服產業是支持各產業數位轉型發展的關鍵，透過參與政府資訊軟體及服務標案，為政府創造出更多便民的服務。<br><b>研議數位專責部會組織訂位座談會</b><br>邀請立法院數位治理委員會范雲會長出席，與軟協理監事一同針對未來數位專責部會的功能進行互動對談。會中也特別邀請叡揚資訊張培鏞董事長擔任引言人，說明軟體產業發展及對專責部會之期許，再請與會人士集思廣益一起討論落實的方向。<br><b>2021資訊服務產業白皮書發表會</b><br>「2021資訊服務產業白皮書」以「健全政府資服產業政策及環境」、「促進國家及產業數位轉型」與「發展資安與新技術，提升台灣創新競爭力」等三大主訴求，展開八項議題及對策；包括智榮基金會施振榮董事長、台灣數位科技與政策協進會高志明理事長、台灣區電機電子工業同業公會李詩欽理事長、臺灣機械工業同業公會柯拔希理事長撰寫序文。感謝經濟部工業局呂正華局長、立法院高虹安委員出席聆聽業界聲音並致詞支持。",
          "options": {
            "OK": "d"
          }
        }
      },
      "d": {
        "func": "exit",
        "kwargs": {
          "next": "s1"
        }
      }
    }
  }
}
